#pragma once

#include <stdio.h>
#include <stdarg.h>
#include "qartuli.h"

typedef FILE ფაილი;
typedef fpos_t ფპოზ_ტ;

ჩასმული მთელი ფდახურვა(ფაილი *სტრიმი) {
    დააბრუნე fclose(სტრიმი);
}

ჩასმული ბათილი წაშალეშცდმ(ფაილი *სტრიმი) {
    clearerr(სტრიმი);
}

ჩასმული მთელი ფბოლო(ფაილი *სტრიმი) {
    დააბრუნე ferror(სტრიმი);
}

ჩასმული მთელი ფშეცდომა(ფაილი *სტრიმი) {
    დააბრუნე ferror(სტრიმი);
}

ჩასმული მთელი ფჩარეცხვა(ფაილი *სტრიმი) {
    დააბრუნე fflush(სტრიმი);
}

ჩასმული მთელი ფმომეპოზ(ფაილი *სტრიმი, ფპოზ_ტ *პოზ) {
    დააბრუნე fgetpos(სტრიმი, პოზ);
}

ჩასმული მთელი ბეჭდვაფ(კონსტ სიმბოლო *ფორმატი, ...) {
    va_list ვარიადიკული_მიმთითებელი;
    va_start(ვარიადიკული_მიმთითებელი, ფორმატი);
    მთელი პასუხი = vprintf(ფორმატი, ვარიადიკული_მიმთითებელი);
    va_end(ვარიადიკული_მიმთითებელი);
    დააბრუნე პასუხი;
}

ჩასმული მთელი სკანირებაფ(კონსტ სიმბოლო *ფორმატი, ...) {
    va_list ვარიადიკული_მიმთითებელი;
    va_start(ვარიადიკული_მიმთითებელი, ფორმატი);
    მთელი პასუხი = vscanf(ფორმატი, ვარიადიკული_მიმთითებელი);
    va_end(ვარიადიკული_მიმთითებელი);
    დააბრუნე პასუხი;
}

ჩასმული მთელი მომესიმბ() {
    დააბრუნე getchar();
}